tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "jimon-s/awsmfa"
tap "leoafarias/fvm"
tap "wata727/tflint"
brew "autoconf"
brew "automake"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "freetype"
brew "fontconfig"
brew "cairo"
brew "docutils"
brew "gh"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "icu4c@76"
brew "harfbuzz"
brew "little-cms2"
brew "gradle"
brew "libtool"
brew "pkgconf"
brew "guile"
brew "hadolint"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "md5sha1sum"
brew "mysql-client"
brew "nvm"
brew "openjdk@17"
brew "pinentry-mac"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "rbenv"
brew "shellcheck"
brew "skaffold"
brew "terminal-notifier"
brew "terraform"
brew "tflint"
brew "tree"
brew "webp"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zplug"
brew "jimon-s/awsmfa/awsmfa"
brew "leoafarias/fvm/fvm"
cask "android-studio"
cask "temurin@17"
cask "visual-studio-code"
vscode "alexcvzz.vscode-sqlite"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "lawrencegrant.cql"
vscode "masakit.zenkaku-hankaku"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "plastic-scm.plastic-scm"
vscode "ryu1kn.partial-diff"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "tfsec.tfsec"
vscode "timonwong.shellcheck"
vscode "tommorris.mako"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
vscode "yzhang.markdown-all-in-one"
