tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jimon-s/awsmfa"
tap "wata727/tflint"
brew "autoconf"
brew "automake"
brew "awscli"
brew "freetype"
brew "cocoapods"
brew "gh"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "gradle"
brew "libtool"
brew "guile"
brew "hadolint"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "md5sha1sum"
brew "nvm"
brew "pinentry-mac"
brew "pyenv"
brew "python@3.10"
brew "shellcheck"
brew "skaffold"
brew "terraform"
brew "tflint"
brew "tree"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "jimon-s/awsmfa/awsmfa"
cask "adoptopenjdk8"
cask "android-studio"
cask "flutter"
cask "temurin17"
cask "visual-studio-code"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "LawrenceGrant.cql"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "shardulm94.trailing-spaces"
vscode "SimonSiefke.svg-preview"
vscode "tfsec.tfsec"
vscode "timonwong.shellcheck"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "vsls-contrib.gistfs"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
